import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-cpl',
  templateUrl: './cpl.component.html',
  styleUrls: ['./cpl.component.scss']
})
export class CPLComponent implements OnInit {

  public title: string = "Курс підготовки для отримання ліцензії комерційного пілота (СPL(A)/IR)";
  public image: any = {
    url: "./assets/images/plane005.png",
    styles: {
      top: '305px',
      height: '243px', width: '652px'
    }
  }

  public staff: any = {
    id: 2,
    name: 'Давидкін Дмитро Володимирович',
    role: 'Керівник з підготовки'
  }

  public info: string = "Мета курсу (CPL(A)/IR – підготовка пілотів для виконання ними комерційних повітряних перевезень, з рівнем компетентності що відповідає правам які передбачені свідоцтвом CPL(A) на однопілотних однодвигунних та багатодвигунних літаках, та у якості другого пілота на багато пілотних літаках (за умов проходження модульного курсу ATPL). Рейтинг IR передбачає право власника виконувати польоти в умовах ІМС (інструментальні метеоумови), за IFR (інструментальні правила польотів)";
  public subtitle: string = "Заявники на отримання свідоцтва СPL(A)";
  public description: string[] = [
    "Заявники на отримання свідоцтва CPL(A) з рейтингом IR проходять не менше",
    "ніж 500 годин теоретичної підготовки та 180 годин льотної підготовки.",
    "Після проходження усіх тестів з теоретичної підготовки (внутрішньо шкільні),",
    "кандидат на отримання ліцензії комерційного пілота допускається до",
    "проходження льотної підготовки."
  ];

  public categories: any[] = [{
    subtitle: 'Структура курсу наступна:',
    list: [{
      name: 'Візуальні польоти на одномоторному літаку К-10 «Свіфт»',
      value: '80 годин'
    }, {
        name: 'Польоти за приладами на одномоторному літаку AERO AT-3 R100',
      value: '45 годин'
    }, {
        name: 'Підготовка на тренажері типу FNPT II Tecnam P2006T (IFR)',
      value: '40 годин'
      },
       {
         name: 'Польоти за IFR (інструментальні правила польотів)',
        value: '15 годин'
      },
      {
      name: 'Екзаменаційний політ',
        value: '2 години 30 хв.'
    }],
    summary: ['Успішне проходження тестів з теоретичної підготовки в Державіаслужбі України є обов’язкова умова для отримання ліцензії комерційного пілота. Термін навчання становить щонайменше 18 місяців.']
  }];

  public reqSubtitle: string = "";
  public reqs: any[] = [{
    subtitle: 'Вимоги до кандидатів:',
    list: [
      {
        name: 'Вік не молодше ніж 17 років.', options: {
          checkbox: true
        }
      },
      {
        name: 'Достатні знання з математики, фізики, української та (або)англійської мови. Підтвердженням може бути атестат про освіту або довідка з навчального закладу, та співбесіда з керівником з підготовки, для визначення рівня знань.', options: {
          checkbox: true
        }
      
      },
      {
        name: 'Стандарт здоров’я – сертифікат 1-го класу. Студент-пілот не виконує самостійні польоти поки не отримає медичний сертифікат.', options: {
          checkbox: true
        }
      },
    ]
  }];

  constructor() { }

  ngOnInit(): void {
  }

}
