import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-ppl',
  templateUrl: './ppl.component.html',
  styleUrls: ['./ppl.component.scss']
})
export class PPLComponent implements OnInit {

  public title: string = "Курс підготовки для отримання ліцензії приватного пілота (PPL(A))";
  public image: any = {
    url: "./assets/images/plane001.png",
    styles: {
      right: '53px', top: '337px',
      height: '219px', width: '698px',
      transform: "rotate(-15deg)"
    }
  }


  public staff: any = {
    id: 1,
    name: 'Остапенко Олександр Анатолійович',
    role: 'Головний льотний інструктор'
  }

  public info: string = "Мета курсу (PPL(A) – підготовка пілотів для виконання ними функцій командира повітряного судна, при виконанні некомерційних перевезень (без отримання грошової винагороди), з рівнем компетентності що відповідає правам які передбачені свідоцтвом PPL(A) на однопілотних однодвигунних літаках за правилами візуальних польотів.";
  public subtitle: string = "Заявники на отримання свідоцтва PPL(A)";
  public description: string[] = [
    "Заявники на отримання свідоцтва PPL(A) проходять не менше ніж 100 годин теоретичної підготовки та 45 годин льотної підготовки.",
    "Логічним закінченням всього навчання є успішне проходження тестів з теоретичної підготовки та екзаменаційний політ з пілотом екзаменатором, призначеним Державіаслужбою України, для встановлення рівня професійних навичок заявника.",
    "Термін навчання становить щонайменше 3 місяці."
  ];


  public reqSubtitle: string = "";
  public reqs: any[] = [{
    subtitle: 'Вимоги до кандидатів:',
    list: [
      {
        name: 'Вік не менше 16-и років.', options: {
          checkbox: true
        }
      },
      {
        name: 'Достатні знання з математики, фізики, української та (або)англійської мови. ', options: {
          checkbox: true
        }
      },
      {
        name: 'Підтвердженням може бути атестат про освіту або довідка з навчального закладу, та співбесіда з керівником з підготовки, для визначення рівня знань.', options: {
          checkbox: true
        }
      },
      {
        name: 'Стандарт здоров’я – сертифікат 2-го класу. Студент-пілот не виконує самостійні польоти поки не отримає медичний сертифікат.', options: {
          checkbox: true
        }
      }
    ]
  }];
  constructor() { }

  ngOnInit(): void {
  }

}
